# Creating a Database

Creating a database is as simple as creating a connection to a non_existent database.

In [1]:
import sqlite3
db = sqlite3.connect("pets_database.db")
cur = db.cursor()

In [2]:
! ls
# Confirming it has been created

Day34_Selecting_Data_with_SQL.ipynb
Day35_Filtering_Data_with_SQL.ipynb
Day36_Ordering_and_Limiting_Data_with_SQL.ipynb
Day37_Grouping_Data_With_SQL.ipynb
Day38_ Database_Admin_101.ipynb
pets_database.db

## Creating Tables
Create a table called `cats` with columns for id, name, age , and breed.

With each column name, also write the datatype and identify the primary key

In [3]:
cur.execute("""
CREATE TABLE cats (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INT,
    breed TEXT)
""")

## Adding Values
To insert rows into a database, we use the `INSERT INTO` command, then the table_name. In parenthesis, add the column names. 

Then add the `VALUES` keyword which is accompanied by the row data. While inserting, please consider the order in which the column names appear in the
`INSERT INTO` column names listed above. You do not have to specify the `id` since it is auto-incrementing.

Remember to enclose strings in quotation marks

In [4]:
cur.execute("""
INSERT INTO cats( name, age, breed)
    VALUES ('Maru', 3, 'Scottish Fold');
""")

In [5]:
cur.execute("""
INSERT INTO cats (name, age, breed)
    VALUES
        ("Hannah", 5, "German Shepherd"),
        ("Lucky", 2, "Rottweiler");
""")

In [6]:
import pandas as pd
pd.read_sql("""
SELECT * FROM cats
""", db)

   id    name  age            breed
0   1    Maru    3    Scottish Fold
1   2  Hannah    5  German Shepherd
2   3   Lucky    2       Rottweiler

## Altering A Table

To update a atble, use the following syntax:

```sql
ALTER TABLE cats
ADD pet_color TEXT
```

## Updating Table Data

The `UPDATE` keyword is used to change pre-existing rows in a table.

It is accompanied with two keywords:

 - `SET` - To set the new value of the column name
 - `WHERE` - To grab the row you want to modify

In [7]:
cur.execute("""
UPDATE cats
SET name = "Hana"
WHERE name = "Hannah";
""")

In [8]:
cur.execute("""
UPDATE cats
SET breed = "Siamese"
WHERE breed = "German Shepherd"
""")

In [9]:
pd.read_sql("""
SELECT * FROM cats;
""", db)

   id   name  age          breed
0   1   Maru    3  Scottish Fold
1   2   Hana    5        Siamese
2   3  Lucky    2     Rottweiler

## Deleting Data

The clause `DELETE FROM` is used to delete a row from a table. The deete keyword is usually followed with a `WHERE` clause.

Always delete using the primary key

In [10]:
cur.execute("""
DELETE FROM cats
WHERE id = 3;
""")

In [11]:
pd.read_sql("""
SELECT * FROM cats;
""", db)

   id  name  age          breed
0   1  Maru    3  Scottish Fold
1   2  Hana    5        Siamese

## Saving

To save the database, you will need to commit the changes to the master database so that other views can also view the updates

**Steps**
- First, preview the results
- Commit the changes using `db.commit()`

In [12]:
# Preview 
cur.execute("""
SELECT * FROM cats
""").fetchall()

[(1, 'Maru', 3, 'Scottish Fold'), (2, 'Hana', 5, 'Siamese')]

In [13]:
# Commit the changes
db.commit()

The database can now be accessed universally even using a different connection

# Database Admin Lab

In [14]:
# Create the database school.sqlite 
sch = sqlite3.connect("school.sqlite")
curr = sch.cursor()

In [15]:
# Create a Table for Contact Information
curr.execute("""
CREATE TABLE contactInfo(
    id INTEGER PRIMARY KEY,
    firstName TEXT,
    lastName TEXT,
    role TEXT,
    telephone INTEGER,
    street TEXT,
    city TEXT,
    state TEXT,
    zipcode INTEGER
)
""")

In [16]:
# A contact dictionary has been made to input the contact Information
# Load the list of dictionaries; just run this cell
import pickle

with open(r'C:\Users\nrmmw\Documents\Flatiron\Repos\Phase_2\dsc-database-admin-101-lab\contact_list.pickle', 'rb') as f:
    contacts = pickle.load(f)

In [20]:
# Iterate over the contact list and populate the contactInfo table here
cleaned_contacts = [{k.strip(): v for k, v in contact.items()} for contact in contacts]
curr.executemany("""
INSERT INTO contactInfo(firstName, lastName, role, telephone, street, city, state, zipcode)
    VALUES(:firstName, :lastName, :role, :telephone, :street, :city, :state, :zipcode);
""", cleaned_contacts)

In [21]:
# Query the Table to Ensure it is populated
pd.read_sql("""
SELECT *
FROM contactInfo;
""", sch)

,id,firstName,lastName,role,telephone,street,city,state,zipcode
0,1,Christine,Holden,staff,2035687697,1672 Whitman Court,Stamford,CT,6995
1,2,Christopher,Warren,student,2175150957,1935 University Hill Road,Champaign,IL,61938
2,3,Linda,Jacobson,staff,4049446441,479 Musgrave Street,Atlanta,GA,30303
3,4,Andrew,Stepp,student,7866419252,2981 Lamberts Branch Road,Hialeah,Fl,33012
4,5,Jane,Evans,student,3259909290,1461 Briarhill Lane,Abilene,TX,79602
5,6,Jane,Evans,student,3259909290,1461 Briarhill Lane,Abilene,TX,79602
6,7,Mary,Raines,student,9075772295,3975 Jerry Toth Drive,Ninilchik,AK,99639
7,8,Ed,Lyman,student,5179695576,3478 Be Sreet,Lansing,MI,48933

In [22]:
sch.commit()

In [25]:
# Create a Table for Student Grades
curr.execute("""
CREATE TABLE grades(
    userId INTEGER NOT NULL,
    courseId INTEGER NOT NULL,
    grade TEXT,
    PRIMARY KEY(userId, courseId)
    );
""")

In [31]:
# Find the duplicate entry
pd.read_sql("""
SELECT *
FROM contactInfo;
""", sch)
# id 5 and 6 are the same

,id,firstName,lastName,role,telephone,street,city,state,zipcode
0,1,Christine,Holden,staff,2035687697,1672 Whitman Court,Stamford,CT,6995
1,2,Christopher,Warren,student,2175150957,1935 University Hill Road,Champaign,IL,61938
2,3,Linda,Jacobson,staff,4049446441,479 Musgrave Street,Atlanta,GA,30303
3,4,Andrew,Stepp,student,7866419252,2981 Lamberts Branch Road,Hialeah,Fl,33012
4,5,Jane,Evans,student,3259909290,1461 Briarhill Lane,Abilene,TX,79602
5,6,Jane,Evans,student,3259909290,1461 Briarhill Lane,Abilene,TX,79602
6,7,Mary,Raines,student,9075772295,3975 Jerry Toth Drive,Ninilchik,AK,99639
7,8,Ed,Lyman,student,5179695576,3478 Be Sreet,Lansing,MI,48933

In [32]:
# Delete the duplicate entry
curr.execute("""
DELETE FROM contactInfo
WHERE id = 6;
""")

In [34]:
pd.read_sql("""
SELECT *
FROM contactInfo;
""", sch)
# Deleted

,id,firstName,lastName,role,telephone,street,city,state,zipcode
0,1,Christine,Holden,staff,2035687697,1672 Whitman Court,Stamford,CT,6995
1,2,Christopher,Warren,student,2175150957,1935 University Hill Road,Champaign,IL,61938
2,3,Linda,Jacobson,staff,4049446441,479 Musgrave Street,Atlanta,GA,30303
3,4,Andrew,Stepp,student,7866419252,2981 Lamberts Branch Road,Hialeah,Fl,33012
4,5,Jane,Evans,student,3259909290,1461 Briarhill Lane,Abilene,TX,79602
5,7,Mary,Raines,student,9075772295,3975 Jerry Toth Drive,Ninilchik,AK,99639
6,8,Ed,Lyman,student,5179695576,3478 Be Sreet,Lansing,MI,48933

In [35]:
# Updating an Address
# Ed Lyman just moved to 2910 Simpson Avenue York, PA 17403. 
# Update his address accordingly.
curr.execute("""
UPDATE contactInfo
SET 
    street = '2910 Simpson Avenue',
    city = 'York',
    state = 'PA',
    zipcode = 17403
WHERE id = 8
""")

In [37]:
pd.read_sql("""
SELECT *
FROM contactInfo
""", sch)
# Updated

,id,firstName,lastName,role,telephone,street,city,state,zipcode
0,1,Christine,Holden,staff,2035687697,1672 Whitman Court,Stamford,CT,6995
1,2,Christopher,Warren,student,2175150957,1935 University Hill Road,Champaign,IL,61938
2,3,Linda,Jacobson,staff,4049446441,479 Musgrave Street,Atlanta,GA,30303
3,4,Andrew,Stepp,student,7866419252,2981 Lamberts Branch Road,Hialeah,Fl,33012
4,5,Jane,Evans,student,3259909290,1461 Briarhill Lane,Abilene,TX,79602
5,7,Mary,Raines,student,9075772295,3975 Jerry Toth Drive,Ninilchik,AK,99639
6,8,Ed,Lyman,student,5179695576,2910 Simpson Avenue,York,PA,17403

In [39]:
# Committing the changes
sch.commit()

This was some bullshit honestly